{
    "temaToggle": {
        "light": "Ativar modo claro",
        "dark": "Ativar modo escuro"
    },
    "languages": {
        "pt-br": "Português (BR)",
        "en": "Inglês (US)"
    },
    "social": {
        "linkedinTooltip": "Visite meu LinkedIn",
        "githubTooltip": "Visite meu GitHub",
        "instagramTooltip": "Visite meu Instagram",
        "emailTooltip": "Envie-me um Email"
    },
    "apresentação": {
        "profissão": "Desenvolvedor Full Stack",
        "frases": [
            "Código com alma, projetos com verdade.",
            "Onde a tecnologia encontra o cuidado, nasce o impacto.",
            "Inovar com propósito, construir com empatia."
        ],
        "descrição": {
            "p1": "Desenvolvedor full-stack especializado em criar produtos digitais performáticos, escaláveis e visualmente refinados. Domina front-end e back-end, com experiência em React, Next.js, TypeScript, Laravel, .NET, Docker e AWS, além de sólida compreensão em design de interface, infraestrutura e microserviços.",

            "p2": "Na Tecnologia Única, desenvolveu uma plataforma completa de gestão de seguros integrando APIs InsureMo, microsserviços em C# e uma camada BFF em React, gerenciando CI/CD via Azure DevOps e implantação na AWS. Na Agência M, liderou a modernização de sistemas legados, migrando de WordPress e PHP para Flutter e React Native, proporcionando experiências integradas entre web e mobile. Anteriormente, na Metalúrgica Sete de Setembro, manteve a confiabilidade de redes e servidores, otimizando sistemas de Active Directory e VPN.",

            "p3": "Criador de projetos como o Nexus, uma plataforma de patrocínio que conecta estudantes da ETEC/FATEC a empresas; MiMiMi, uma ferramenta de análise emocional baseada em IA para escolas; e o app FETEPS, uma feira digital para inovação educacional.",

            "p4": "Movido por precisão e usabilidade, uno design cuidadoso com engenharia robusta para entregar interfaces que funcionam perfeitamente em diversos ambientes. Sempre focado em clareza, escalabilidade e impacto significativo por meio da tecnologia."
        },
        "tecnologias": "TECNOLOGIAS"
    },
    "empregos": {
        "titulo": "Minhas Experiências",
        "unica": {
            "cargo": "Desenvolvedor Full Stack",
            "descrição": "Projeto e desenvolvo uma plataforma escalável de gestão de seguros que abrange todos os fluxos operacionais e de negócios do mercado segurador. Construo o front-end utilizando React, TypeScript e Vite, priorizando alto desempenho e fácil manutenção. Desenvolvo o back-end em .NET e C#, implementando uma arquitetura de microsserviços e uma camada BFF integrada às APIs e serviços do InsureMo. Implanto e gerencio a infraestrutura na AWS, garantindo confiabilidade e escalabilidade. Coordeno as tarefas da equipe e os pipelines de CI/CD via Azure DevOps, assegurando eficiência na entrega e colaboração."
        },
        "agenciam": {
            "cargo": "Desenvolvedor Mobile e Web",
            "descrição": "Liderei o desenvolvimento front-end e a modernização das plataformas mobile e web. Mantive e otimizei um sistema legado em WordPress e PHP hospedado em cPanel. Refatorei um aplicativo existente em React Native para melhorar o desempenho e a qualidade do código, e desenvolvi uma nova versão multiplataforma totalmente redesenhada utilizando Flutter em colaboração com as APIs do Google. Colaborei de perto com a equipe de design por meio do Figma para garantir uma interface e experiência de usuário consistentes entre Android e iOS."
        },
        "seteDeSetembro": {
            "cargo": "Assistente de infraestrutura",
            "descrição": "Prestei suporte técnico e garanti a confiabilidade da infraestrutura de TI da empresa. Gerenciei ambientes Windows Server, configurei redes e mantive sistemas de hardware e software. Supervisei o controle de acesso de usuários por meio do Active Directory, otimizei conexões VPN para equipes remotas e administrei os ambientes do Office e SharePoint para aprimorar a colaboração e a segurança dos dados."
        }
    },
    "projetos": {
        "titulo": "Meus Projetos",
        "nexus": {
            "descricao": "O Nexus é uma plataforma digital que conecta projetos de estudantes das ETECs e FATECs a empresas e patrocinadores. Seu objetivo é dar visibilidade e apoio a ideias inovadoras, promovendo o empreendedorismo na educação. Por meio da plataforma, os alunos podem apresentar seus projetos, enquanto as empresas oferecem financiamento, mentoria ou materiais, formando uma rede colaborativa entre as escolas e o setor empresarial."
        },
        "mimimi": {
            "descricao": "O Projeto MIMIMI utiliza inteligência artificial para apoiar o bem-estar emocional dos alunos. Por meio de um robô com QR Code, os estudantes compartilham anonimamente palavras sobre seus sentimentos. Essas palavras são analisadas para gerar nuvens que revelam padrões emocionais em cada turma, ajudando as escolas a identificar precocemente sinais de sofrimento e conectar os alunos ao apoio psicológico adequado."
        },
        "feteps": {
            "descricao": "O aplicativo FETEPS é uma aplicação mobile desenvolvida para apresentar, organizar e acompanhar os projetos exibidos na Feira Tecnológica do Centro Paula Souza. Ele permite que alunos, professores e avaliadores acessem facilmente informações sobre os projetos, cronogramas, resultados e certificados, oferecendo uma experiência prática e moderna."
        },
        "botoes": {
            "verProjeto": "Ver Projeto",
            "verCodigo": "Ver Código",
            "verMais": "Ver Mais"
        }
    },
    "contato": {
        "titulo": "Vamos trabalhar juntos",
        "descrição": "Estou sempre interessado em ouvir sobre novos projetos e oportunidades. Seja para tirar uma dúvida ou apenas dizer oi, sinta-se à vontade para entrar em contato!",
        "form": {
            "inputsLabels": {
                "nome": "Nome",
                "email": "Email",
                "assunto": "Assunto",
                "mensagem": "Mensagem"
            },
            "placeholder": {
                "nome": "Seu nome",
                "email": "Seu email",
                "assunto": "do que se trata",
                "mensagem": "diga-me mais..."
            },
            "botaoEnviar": "Enviar Mensagem",
            "toast": {
                "success": "Email enviado com sucesso!",
                "error": "Falha ao enviar o email. Por favor, tente novamente mais tarde."
            }
        }
    }
}
